// eslint-disable-next-line import/prefer-default-export
export const bankCode = [
  {
    name: '银联商务（收单）',
    code: '001',
  },
  {
    name: '中国邮政储蓄银行（收单）',
    code: '100',
  },
  {
    name: '中国工商银行',
    code: '102',
  },
  {
    name: '中国农业银行',
    code: '103',
  },
  {
    name: '中国银行',
    code: '104',
  },
  {
    name: '中国建设银行',
    code: '105',
  },
  {
    name: '国家开发银行',
    code: '201',
  },
  {
    name: '中国进出口银行',
    code: '202',
  },
  {
    name: '中国农业发展银行',
    code: '203',
  },
  {
    name: '交通银行',
    code: '301',
  },
  {
    name: '中信银行',
    code: '302',
  },
  {
    name: '中国光大银行',
    code: '303',
  },
  {
    name: '华夏银行',
    code: '304',
  },
  {
    name: '中国民生银行',
    code: '305',
  },
  {
    name: '广东发展银行',
    code: '306',
  },
  {
    name: '深圳发展银行',
    code: '307',
  },
  {
    name: '招商银行',
    code: '308',
  },
  {
    name: '兴业银行',
    code: '309',
  },
  {
    name: '上海浦东发展银行',
    code: '310',
  },
  {
    name: '上海银联商务/东莞商业银行',
    code: '311',
  },
  {
    name: '城市商业银行',
    code: '313',
  },
  {
    name: '农村商业银行（江苏）',
    code: '314',
  },
  {
    name: '恒丰银行',
    code: '315',
  },
  {
    name: '浙商银行',
    code: '316',
  },
  {
    name: '农村合作银行',
    code: '317',
  },
  {
    name: '渤海银行股份有限公司',
    code: '318',
  },
  {
    name: '徽商银行股份有限公司',
    code: '319',
  },
  {
    name: '镇银行有限责任公司',
    code: '320',
  },
  {
    name: '城市信用社',
    code: '401',
  },
  {
    name: '农村信用社（含北京农村商业银行）、东莞农信',
    code: '402',
  },
  {
    name: '中国邮政储蓄银行（代收付）',
    code: '403',
  },
  {
    name: '汇丰银行',
    code: '501',
  },
  {
    name: '东亚银行',
    code: '502',
  },
  {
    name: '南洋商业银行',
    code: '503',
  },
  {
    name: '恒生银行(中国)有限公司',
    code: '504',
  },
  {
    name: '中国银行（香港）有限公司',
    code: '505',
  },
  {
    name: '集友银行有限公司',
    code: '506',
  },
  {
    name: '创兴银行有限公司',
    code: '507',
  },
  {
    name: '星展银行（中国）有限公司',
    code: '509',
  },
  {
    name: '永亨银行（中国）有限公司',
    code: '510',
  },
  {
    name: '永隆银行',
    code: '512',
  },
  {
    name: '花旗银行（中国）有限公司',
    code: '531',
  },
  {
    name: '美国银行有限公司',
    code: '532',
  },
  {
    name: '摩根大通银行(中国)有限公司',
    code: '533',
  },
  {
    name: '三菱东京日联银行(中国）有限公司',
    code: '561',
  },
  {
    name: '日本三井住友银行股份有限公司',
    code: '563',
  },
  {
    name: '瑞穗实业银行（中国）有限公司',
    code: '564',
  },
  {
    name: '日本山口银行股份有限公司',
    code: '565',
  },
  {
    name: '韩国外换银行股份有限公司',
    code: '591',
  },
  {
    name: '友利银行(中国)有限公司',
    code: '593',
  },
  {
    name: '韩国外换银行股份有限公司',
    code: '591',
  },
  {
    name: '友利银行（中国）有限公司',
    code: '593',
  },
  {
    name: '韩国产业银行',
    code: '594',
  },
  {
    name: '新韩银行(中国)有限公司',
    code: '595',
  },
  {
    name: '韩国中小企业银行有限公司',
    code: '596',
  },
  {
    name: '韩亚银行（中国）有限公司',
    code: '597',
  },
  {
    name: '华侨银行（中国）有限公司',
    code: '621',
  },
  {
    name: '大华银行（中国）有限公司',
    code: '622',
  },
  {
    name: '星展银行（中国）有限公司',
    code: '623',
  },
  {
    name: '泰国盘谷银行(大众有限公司)',
    code: '631',
  },
  {
    name: '奥地利中央合作银行股份有限公司',
    code: '641',
  },
  {
    name: '比利时联合银行股份有限公司',
    code: '651',
  },
  {
    name: '比利时富通银行有限公司',
    code: '652',
  },
  {
    name: '荷兰银行',
    code: '661',
  },
  {
    name: '荷兰安智银行股份有限公司',
    code: '662',
  },
  {
    name: '渣打银行',
    code: '671',
  },
  {
    name: '英国苏格兰皇家银行公众有限公司',
    code: '672',
  },
  {
    name: '法国兴业银行（中国)有限公司',
    code: '691',
  },
  {
    name: '法国东方汇理银行股份有限公司',
    code: '694',
  },
  {
    name: '法国外贸银行股份有限公司',
    code: '695',
  },
  {
    name: '德国德累斯登银行股份公司',
    code: '711',
  },
  {
    name: '德意志银行（中国）有限公司',
    code: '712',
  },
  {
    name: '德国商业银行股份有限公司',
    code: '713',
  },
  {
    name: '德国西德银行股份有限公司',
    code: '714',
  },
  {
    name: '德国巴伐利亚州银行',
    code: '715',
  },
  {
    name: '德国北德意志州银行',
    code: '716',
  },
  {
    name: '意大利联合圣保罗银行股份有限公司',
    code: '732',
  },
  {
    name: '瑞士信贷银行股份有限公司',
    code: '741',
  },
  {
    name: '瑞士银行',
    code: '742',
  },
  {
    name: '加拿大丰业银行有限公司',
    code: '751',
  },
  {
    name: '加拿大蒙特利尔银行有限公司',
    code: '752',
  },
  {
    name: '澳大利亚和新西兰银行集团有限公司',
    code: '761',
  },
  {
    name: '摩根士丹利国际银行（中国）有限公司',
    code: '771',
  },
  {
    name: '联合银行(中国)有限公司',
    code: '775',
  },
  {
    name: '荷兰合作银行有限公司',
    code: '776',
  },
  {
    name: '厦门国际银行',
    code: '781',
  },
  {
    name: '法国巴黎银行（中国）有限公司',
    code: '782',
  },
  {
    name: '华商银行',
    code: '785',
  },
  {
    name: '华一银行',
    code: '787',
  },
  {
    name: '广东农村信用合作社（收单）',
    code: '897',
  },
  {
    name: '银联商务（收单）',
    code: '898',
  },
  {
    name: '(澳门地区)银行',
    code: '969',
  },
  {
    name: '(香港地区)银行',
    code: '989',
  },
];
